'''
Зміни програму нижче таким чином, щоб створити два об'єкти кімнат:
перша кімната з шириною 4, довжиною 4.5, висотою 2.5 та
друга кімната з висотою 2.7, шириною 4, довжиною 5.
Доповни програму вказівками для виведення плош обох кімнат
'''
# Визначаємо клас кімнат
class Room :
    # описуємо конструктор об'єкту
    def __init__(self, h = 2, w = 3, l = 5):
        self.h = h # висота кімнати
        self.w = w # ширина кімнати
        self.l = l # довжина кімнати
    # описуємо метод визначення площі кімнати    
    def square(self):
        return self.w * self.l
    
room1 = Room() # створення кімнати 1
room2 = Room() # створення кімнати 2

print("Height 1:", room1.h) # повідомляємо довжину кімнати 1
print("Length 2:", room2.l) # повідомляємо довжину кімнати 2
