'''
Зміни програму нижче таким чином, щоб при створенні об'єктів кімнат
з їх стандартними розмірами для першої кімнати висота була визначена у 2.5,
а для другої кімнати довжина була визначена у 4
'''
# Визначаємо клас кімнат
class Room :
    def __init__(self, h = 2, w = 3, l = 5):
        self.h = h # висота кімнати
        self.w = w # ширина кімнати
        self.l = l # довжина кімнати
    
room1 = Room() # створення кімнати 1
room2 = Room() # створення кімнати 2

print("Height 1:", room1.h) # повідомляємо довжину кімнати 1
print("Length 2:", room2.l) # повідомляємо довжину кімнати 2
